In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_excel(r'Datasets\Bank_Churn_Messy.xlsx', sheet_name = 'Customer_Info')

In [3]:
df1.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary
0,15634602,Hargrave,619,FRA,Female,42.0,2,€101348.88
1,15647311,Hill,608,Spain,Female,41.0,1,€112542.58
2,15619304,Onio,502,French,Female,42.0,8,€113931.57
3,15701354,Boni,699,FRA,Female,39.0,1,€93826.63
4,15737888,Mitchell,850,Spain,Female,43.0,2,€79084.1

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001 entries, 0 to 10000
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10001 non-null  int64
 1   Surname          9998 non-null   object
 2   CreditScore      10001 non-null  int64
 3   Geography        10001 non-null  object
 4   Gender           10001 non-null  object
 5   Age              9998 non-null   float64
 6   Tenure           10001 non-null  int64
 7   EstimatedSalary  10001 non-null  object
dtypes: float64(1), int64(3), object(4)
memory usage: 625.2+ KB

In [5]:
df1.isnull().sum()

CustomerId         0
Surname            3
CreditScore        0
Geography          0
Gender             0
Age                3
Tenure             0
EstimatedSalary    0
dtype: int64

In [6]:
df1['Surname'] = df1['Surname'].fillna(df1['Surname'].mode()[0])
df1['Age'] = df1['Age'].fillna(df1['Age'].mean())

In [7]:
df1.isnull().sum()

CustomerId         0
Surname            0
CreditScore        0
Geography          0
Gender             0
Age                0
Tenure             0
EstimatedSalary    0
dtype: int64

In [8]:
df1['Age'] = df1['Age'].astype('int64')

In [9]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001 entries, 0 to 10000
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10001 non-null  int64
 1   Surname          10001 non-null  object
 2   CreditScore      10001 non-null  int64
 3   Geography        10001 non-null  object
 4   Gender           10001 non-null  object
 5   Age              10001 non-null  int64
 6   Tenure           10001 non-null  int64
 7   EstimatedSalary  10001 non-null  object
dtypes: int64(4), object(4)
memory usage: 625.2+ KB

In [10]:
df1.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary
0,15634602,Hargrave,619,FRA,Female,42,2,€101348.88
1,15647311,Hill,608,Spain,Female,41,1,€112542.58
2,15619304,Onio,502,French,Female,42,8,€113931.57
3,15701354,Boni,699,FRA,Female,39,1,€93826.63
4,15737888,Mitchell,850,Spain,Female,43,2,€79084.1

In [11]:
df1['Geography'].unique()

array(['FRA', 'Spain', 'French', 'France', 'Germany'], dtype=object)

In [12]:
df1['Geography'] = df1['Geography'].replace('FRA', 'France')
df1['Geography'] = df1['Geography'].replace('French', 'France')

In [13]:
df1['Geography'].unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [14]:
df1['EstimatedSalary'] = df1['EstimatedSalary'].str.replace('€','')

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001 entries, 0 to 10000
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10001 non-null  int64
 1   Surname          10001 non-null  object
 2   CreditScore      10001 non-null  int64
 3   Geography        10001 non-null  object
 4   Gender           10001 non-null  object
 5   Age              10001 non-null  int64
 6   Tenure           10001 non-null  int64
 7   EstimatedSalary  10001 non-null  object
dtypes: int64(4), object(4)
memory usage: 625.2+ KB

In [16]:
df1['EstimatedSalary'] = df1['EstimatedSalary'].astype('float64')

In [17]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10001 entries, 0 to 10000
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerId       10001 non-null  int64
 1   Surname          10001 non-null  object
 2   CreditScore      10001 non-null  int64
 3   Geography        10001 non-null  object
 4   Gender           10001 non-null  object
 5   Age              10001 non-null  int64
 6   Tenure           10001 non-null  int64
 7   EstimatedSalary  10001 non-null  float64
dtypes: float64(1), int64(4), object(3)
memory usage: 625.2+ KB

In [18]:
df1.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary
0,15634602,Hargrave,619,France,Female,42,2,101348.88
1,15647311,Hill,608,Spain,Female,41,1,112542.58
2,15619304,Onio,502,France,Female,42,8,113931.57
3,15701354,Boni,699,France,Female,39,1,93826.63
4,15737888,Mitchell,850,Spain,Female,43,2,79084.10

In [19]:
df2 = pd.read_excel(r'Datasets\Bank_Churn_Messy.xlsx', sheet_name = 'Account_Info')

In [20]:
df2.head()

,CustomerId,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited
0,15634602,€0.0,1,Yes,2,Yes,1
1,15634602,€0.0,1,Yes,2,Yes,1
2,15647311,€83807.86,1,Yes,1,Yes,0
3,15619304,€159660.8,3,No,8,No,1
4,15701354,€0.0,2,No,1,No,0

In [21]:
df2['Balance'] = df2['Balance'].str.replace('€','')

In [22]:
df2['Balance'] = df2['Balance'].astype('float64')

In [23]:
df2.head()

,CustomerId,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited
0,15634602,0.00,1,Yes,2,Yes,1
1,15634602,0.00,1,Yes,2,Yes,1
2,15647311,83807.86,1,Yes,1,Yes,0
3,15619304,159660.80,3,No,8,No,1
4,15701354,0.00,2,No,1,No,0

In [24]:
df1.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,EstimatedSalary
0,15634602,Hargrave,619,France,Female,42,2,101348.88
1,15647311,Hill,608,Spain,Female,41,1,112542.58
2,15619304,Onio,502,France,Female,42,8,113931.57
3,15701354,Boni,699,France,Female,39,1,93826.63
4,15737888,Mitchell,850,Spain,Female,43,2,79084.10

In [25]:
merged_df = pd.merge(df1, df2, on='CustomerId', suffixes=('_cust','_acc'))

In [26]:
merged_df.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure_cust,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure_acc,IsActiveMember,Exited
0,15634602,Hargrave,619,France,Female,42,2,101348.88,0.00,1,Yes,2,Yes,1
1,15634602,Hargrave,619,France,Female,42,2,101348.88,0.00,1,Yes,2,Yes,1
2,15647311,Hill,608,Spain,Female,41,1,112542.58,83807.86,1,Yes,1,Yes,0
3,15619304,Onio,502,France,Female,42,8,113931.57,159660.80,3,No,8,No,1
4,15701354,Boni,699,France,Female,39,1,93826.63,0.00,2,No,1,No,0

In [27]:
merged_df = merged_df.drop(columns = ['Tenure_cust'])

In [28]:
merged_df.rename(columns = {
    'Tenure_acc' : 'Tenure'
}, inplace = True)

In [29]:
merged_df.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,EstimatedSalary,Balance,NumOfProducts,HasCrCard,Tenure,IsActiveMember,Exited
0,15634602,Hargrave,619,France,Female,42,101348.88,0.00,1,Yes,2,Yes,1
1,15634602,Hargrave,619,France,Female,42,101348.88,0.00,1,Yes,2,Yes,1
2,15647311,Hill,608,Spain,Female,41,112542.58,83807.86,1,Yes,1,Yes,0
3,15619304,Onio,502,France,Female,42,113931.57,159660.80,3,No,8,No,1
4,15701354,Boni,699,France,Female,39,93826.63,0.00,2,No,1,No,0

In [30]:
merged_df.shape

(10004, 13)

In [31]:
merged_df.nunique()

CustomerId         10000
Surname             2932
CreditScore          460
Geography              3
Gender                 2
Age                   70
EstimatedSalary     9997
Balance             6382
NumOfProducts          4
HasCrCard              2
Tenure                11
IsActiveMember         2
Exited                 2
dtype: int64

In [32]:
merged_df.drop_duplicates(inplace = True)

In [33]:
merged_df.shape

(10000, 13)

In [34]:
merged_df.to_csv('01_Cleaned_File(Pandas).csv', index = False)